; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	spectrograph0 - mode
	thermograph2 - mode
	image1 - mode
	image3 - mode
	Star1 - direction
	Star0 - direction
	GroundStation2 - direction
	Star3 - direction
	Phenomenon4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Planet7 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 image3)
	(calibration_target instrument0 Star0)
	(supports instrument1 image3)
	(supports instrument1 spectrograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 image1)
	(supports instrument2 image3)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 175)
	(supports instrument3 thermograph2)
	(supports instrument3 spectrograph0)
	(supports instrument3 image3)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 image3)
	(supports instrument4 image1)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 151)
	(= (data Star3 spectrograph0) 293)
	(= (data Phenomenon4 spectrograph0) 176)
	(= (data Phenomenon5 spectrograph0) 280)
	(= (data Star6 spectrograph0) 256)
	(= (data Planet7 spectrograph0) 105)
	(= (data Star3 thermograph2) 138)
	(= (data Phenomenon4 thermograph2) 160)
	(= (data Phenomenon5 thermograph2) 39)
	(= (data Star6 thermograph2) 227)
	(= (data Planet7 thermograph2) 244)
	(= (data Star3 image1) 217)
	(= (data Phenomenon4 image1) 99)
	(= (data Phenomenon5 image1) 168)
	(= (data Star6 image1) 47)
	(= (data Planet7 image1) 203)
	(= (data Star3 image3) 76)
	(= (data Phenomenon4 image3) 234)
	(= (data Phenomenon5 image3) 170)
	(= (data Star6 image3) 245)
	(= (data Planet7 image3) 34)
	(= (slew_time Star1 Star0) 27.6)
	(= (slew_time Star0 Star1) 27.6)
	(= (slew_time GroundStation2 Star0) 42.05)
	(= (slew_time Star0 GroundStation2) 42.05)
	(= (slew_time GroundStation2 Star1) 49.61)
	(= (slew_time Star1 GroundStation2) 49.61)
	(= (slew_time Star3 Star0) 61.36)
	(= (slew_time Star0 Star3) 61.36)
	(= (slew_time Star3 Star1) 10.29)
	(= (slew_time Star1 Star3) 10.29)
	(= (slew_time Star3 GroundStation2) 36.55)
	(= (slew_time GroundStation2 Star3) 36.55)
	(= (slew_time Phenomenon4 Star0) 87.38)
	(= (slew_time Star0 Phenomenon4) 87.38)
	(= (slew_time Phenomenon4 Star1) 4.959)
	(= (slew_time Star1 Phenomenon4) 4.959)
	(= (slew_time Phenomenon4 GroundStation2) 66.2)
	(= (slew_time GroundStation2 Phenomenon4) 66.2)
	(= (slew_time Phenomenon4 Star3) 40.31)
	(= (slew_time Star3 Phenomenon4) 40.31)
	(= (slew_time Phenomenon5 Star0) 66.36)
	(= (slew_time Star0 Phenomenon5) 66.36)
	(= (slew_time Phenomenon5 Star1) 48.94)
	(= (slew_time Star1 Phenomenon5) 48.94)
	(= (slew_time Phenomenon5 GroundStation2) 74.12)
	(= (slew_time GroundStation2 Phenomenon5) 74.12)
	(= (slew_time Phenomenon5 Star3) 95.86)
	(= (slew_time Star3 Phenomenon5) 95.86)
	(= (slew_time Phenomenon5 Phenomenon4) 20.92)
	(= (slew_time Phenomenon4 Phenomenon5) 20.92)
	(= (slew_time Star6 Star0) 76.52)
	(= (slew_time Star0 Star6) 76.52)
	(= (slew_time Star6 Star1) 1.313)
	(= (slew_time Star1 Star6) 1.313)
	(= (slew_time Star6 GroundStation2) 23.13)
	(= (slew_time GroundStation2 Star6) 23.13)
	(= (slew_time Star6 Star3) 31.7)
	(= (slew_time Star3 Star6) 31.7)
	(= (slew_time Star6 Phenomenon4) 23.47)
	(= (slew_time Phenomenon4 Star6) 23.47)
	(= (slew_time Star6 Phenomenon5) 12.66)
	(= (slew_time Phenomenon5 Star6) 12.66)
	(= (slew_time Planet7 Star0) 29.83)
	(= (slew_time Star0 Planet7) 29.83)
	(= (slew_time Planet7 Star1) 4.957)
	(= (slew_time Star1 Planet7) 4.957)
	(= (slew_time Planet7 GroundStation2) 22.2)
	(= (slew_time GroundStation2 Planet7) 22.2)
	(= (slew_time Planet7 Star3) 78.44)
	(= (slew_time Star3 Planet7) 78.44)
	(= (slew_time Planet7 Phenomenon4) 6.214)
	(= (slew_time Phenomenon4 Planet7) 6.214)
	(= (slew_time Planet7 Phenomenon5) 57.36)
	(= (slew_time Phenomenon5 Planet7) 57.36)
	(= (slew_time Planet7 Star6) 57.3)
	(= (slew_time Star6 Planet7) 57.3)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Star3 thermograph2)
	(have_image Phenomenon4 thermograph2)
	(have_image Phenomenon5 spectrograph0)
	(have_image Star6 thermograph2)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite1 star1 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star1)
   changed: (fuel satellite1) from 151 to 149.687, (fuel-used) from 0 to 1.313
   goals met: 0 of 4
2. (turn_to satellite1 phenomenon4 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 149.687 to 144.728, (fuel-used) from 1.313 to 6.272
   goals met: 0 of 4
3. (turn_to satellite1 planet7 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 144.728 to 138.514, (fuel-used) from 6.272 to 12.486
   goals met: 0 of 4
4. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 4
5. (turn_to satellite1 phenomenon4 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 138.514 to 132.3, (fuel-used) from 12.486 to 18.7
   goals met: 0 of 4
6. (turn_to satellite1 star1 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star1)
   changed: (fuel satellite1) from 132.3 to 127.341, (fuel-used) from 18.7 to 23.659
   goals met: 0 of 4
7. (switch_off instrument4 satellite1)
   deleted: (power_on instrument4)
   added: (power_avail satellite1)
   goals met: 0 of 4
8. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 4
9. (turn_to satellite1 phenomenon4 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 127.341 to 122.382, (fuel-used) from 23.659 to 28.618
   goals met: 0 of 4
10. (turn_to satellite1 planet7 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 122.382 to 116.168, (fuel-used) from 28.618 to 34.832
   goals met: 0 of 4
11. (turn_to satellite1 phenomenon4 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 116.168 to 109.954, (fuel-used) from 34.832 to 41.046
   goals met: 0 of 4
12. (turn_to satellite1 planet7 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 109.954 to 103.74, (fuel-used) from 41.046 to 47.26
   goals met: 0 of 4
13. (turn_to satellite1 phenomenon4 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 103.74 to 97.526, (fuel-used) from 47.26 to 53.474
   goals met: 0 of 4
14. (turn_to satellite1 planet7 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 97.526 to 91.312, (fuel-used) from 53.474 to 59.688
   goals met: 0 of 4
15. (turn_to satellite1 phenomenon4 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 91.312 to 85.098, (fuel-used) from 59.688 to 65.902
   goals met: 0 of 4
16. (turn_to satellite1 planet7 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 85.098 to 78.884, (fuel-used) from 65.902 to 72.116
   goals met: 0 of 4
17. (turn_to satellite1 phenomenon4 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 78.884 to 72.67, (fuel-used) from 72.116 to 78.33
   goals met: 0 of 4
18. (turn_to satellite1 star1 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star1)
   changed: (fuel satellite1) from 72.67 to 67.711, (fuel-used) from 78.33 to 83.289
   goals met: 0 of 4
19. (turn_to satellite1 star6 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 67.711 to 66.398, (fuel-used) from 83.289 to 84.602
   goals met: 0 of 4
20. (turn_to satellite1 groundstation2 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 66.398 to 43.268, (fuel-used) from 84.602 to 107.732
   goals met: 0 of 4
21. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 0 of 4
22. (turn_to satellite1 star6 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 43.268 to 20.138, (fuel-used) from 107.732 to 130.862
   goals met: 0 of 4
23. (take_image satellite1 star6 instrument3 thermograph2)
   added: (have_image star6 thermograph2)
   changed: (data_capacity satellite1) from 1000 to 773, (data-stored) from 0 to 227
   goals met: 1 of 4
24. (turn_to satellite1 star1 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star1)
   changed: (fuel satellite1) from 20.138 to 18.825, (fuel-used) from 130.862 to 132.175
   goals met: 1 of 4
25. (turn_to satellite1 star6 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 18.825 to 17.512, (fuel-used) from 132.175 to 133.488
   goals met: 1 of 4
26. (turn_to satellite1 star1 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star1)
   changed: (fuel satellite1) from 17.512 to 16.199, (fuel-used) from 133.488 to 134.801
   goals met: 1 of 4
27. (turn_to satellite1 phenomenon4 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 16.199 to 11.24, (fuel-used) from 134.801 to 139.76
   goals met: 1 of 4
28. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 4
29. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 1 of 4
30. (turn_to satellite0 phenomenon5 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 175 to 100.88, (fuel-used) from 139.76 to 213.88
   goals met: 1 of 4
31. (take_image satellite1 phenomenon4 instrument3 thermograph2)
   added: (have_image phenomenon4 thermograph2)
   changed: (data_capacity satellite1) from 773 to 613, (data-stored) from 227 to 387
   goals met: 2 of 4
32. (take_image satellite0 phenomenon5 instrument1 spectrograph0)
   added: (have_image phenomenon5 spectrograph0)
   changed: (data_capacity satellite0) from 1000 to 720, (data-stored) from 387 to 667
   goals met: 3 of 4
33. (turn_to satellite1 star1 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star1)
   changed: (fuel satellite1) from 11.24 to 6.281, (fuel-used) from 213.88 to 218.839
   goals met: 3 of 4
34. (turn_to satellite0 star6 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 100.88 to 88.22, (fuel-used) from 218.839 to 231.499
   goals met: 3 of 4
35. (turn_to satellite0 star1 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 88.22 to 86.907, (fuel-used) from 231.499 to 232.812
   goals met: 3 of 4
36. (turn_to satellite0 star0 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 86.907 to 59.307, (fuel-used) from 232.812 to 260.412
   goals met: 3 of 4
37. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 3 of 4
38. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 4
39. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 3 of 4
40. (turn_to satellite0 star1 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 59.307 to 31.707, (fuel-used) from 260.412 to 288.012
   goals met: 3 of 4
41. (turn_to satellite0 star3 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 31.707 to 21.417, (fuel-used) from 288.012 to 298.302
   goals met: 3 of 4
42. (take_image satellite0 star3 instrument0 thermograph2)
   added: (have_image star3 thermograph2)
   changed: (data_capacity satellite0) from 720 to 582, (data-stored) from 667 to 805
   goals met: 4 of 4
